Котельников_АБ_70153995/src/Documents/Вакансия/Вакансия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакансия</name>
  <basedOn>Document.СогласованиеЗаявки</basedOn>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СогласованиеЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВакансияРазмещенаНаСайте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВакансию</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВакансии</name>
    <type>
      <types>EnumRef.СтатусыВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>EnumRef.ОпытРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоВычетаНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФорматированногоТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКВакансии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрофессиональныеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.ПрофессиональныеНавыки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниПрофессиональныхНавыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныеКачества</name>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.ЛичныеКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.Языки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/Вакансия/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СогласованиеЗаявки") Тогда
		ЗаявкаНаПодбор = ДанныеЗаполнения.Заявка; 
		ДокументОснование = ЗаявкаНаПодбор;
		ПланируемаяДатаЗакрытия = ЗаявкаНаПодбор.ПланируемыйСрокЗакрытия;
		Подразделение = ЗаявкаНаПодбор.Подразделение;
		Должность = ЗаявкаНаПодбор.ВакантнаяДолжность;
		ПрофильДолжности = ЗаявкаНаПодбор.ПрофильДолжности;
		Образование = ЗаявкаНаПодбор.Образование;
		ОпытРаботы = ЗаявкаНаПодбор.ОпытРаботы; 
		ТипЗанятости = ЗаявкаНаПодбор.ТипЗанятости;
		ГрафикРаботы = ЗаявкаНаПодбор.ГрафикРаботы; 
		ФорматРаботы = ЗаявкаНаПодбор.ФорматРаботы;
		ОплатаТрудаОт = ЗаявкаНаПодбор.ОплатаТрудаОт;
		ОплатаТрудаДо = ЗаявкаНаПодбор.ОплатаТрудаДо;
		ДоВычетаНалога = ЗаявкаНаПодбор.ДоВычетаНалога;
						
		ПрофессиональныеНавыки.Загрузить(ЗаявкаНаПодбор.ПрофессиональныеНавыки.Выгрузить());
		ЛичныеКачества.Загрузить(ЗаявкаНаПодбор.ЛичныеКачества.Выгрузить());
		ЗнанияЯзыков.Загрузить(ЗаявкаНаПодбор.ЗнанияЯзыков.Выгрузить());
				
	КонецЕсли;

КонецПроцедуры
